tap "blacktop/tap"
tap "homebrew/bundle"
tap "pomdtr/tap"
brew "bat"
brew "chezmoi"
brew "clang-format"
brew "coreutils"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "lizard-analyzer"
brew "make"
brew "mas"
brew "neovim"
brew "node"
brew "openjdk"
brew "rust"
brew "stow"
brew "telnet"
brew "tmux"
brew "tree"
brew "zoxide"
brew "zsh-autosuggestions"
brew "blacktop/tap/lporg"
brew "pomdtr/tap/ray"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alt-tab"
cask "darktable"
cask "google-chrome"
cask "iina"
cask "keka"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "r"
cask "raycast"
cask "rectangle"
cask "rstudio"
cask "spotify"
cask "termius"
cask "visual-studio-code"
cask "whatsapp"
mas "Amphetamine", id: 937984704
mas "Goodnotes", id: 1444383602
mas "Spark Desktop", id: 6445813049
mas "Xcode", id: 497799835
vscode "1password.op-vscode"
vscode "alexcvzz.vscode-sqlite"
vscode "donjayamanne.githistory"
vscode "ecmel.vscode-html-css"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "neilbrayfield.php-docblocker"
vscode "ritwickdey.liveserver"
vscode "vscjava.vscode-java-dependency"
vscode "waderyan.gitblame"
vscode "xabikos.javascriptsnippets"
vscode "zhuangtongfa.material-theme"
