# Brewfile - brew bundle

# Homebrew Packages
brew "bat"
brew "clang-format"
brew "coreutils"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "lizard-analyzer"
brew "make"
brew "mas"
brew "neovim"
brew "node"
brew "openjdk"
brew "rust"
brew "stow"
brew "telnet"
brew "tmux"
brew "tree"
brew "zoxide"
brew "zsh-autosuggestions"

# Casks
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alt-tab"
cask "google-chrome"
cask "iina"
cask "keka"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "termius"
cask "visual-studio-code"
cask "whatsapp"

# App Store Apps
mas "Amphetamine", id: 937984704
mas "Goodnotes", id: 1444383602
mas "Spark Desktop", id: 6445813049
mas "Xcode", id: 497799835

